Readme.md

# Table of Contents

1.  [Light Tomatoes a Pomodoro Technique Notification with Lights](#org482b860)
    1.  [MVP Features for Philips Hue Lights](#orgbfd7d4e)
        1.  [Send a state change request after 25 min to indicate small break time of 5 min](#orgf5350f4)
        2.  [Send a state change reqest after the 5 min break has expired](#org021d3f7)


<a id="org482b860"></a>

# Light Tomatoes a Pomodoro Technique Notification with Lights

Light Tomatoes is a application that will send state change alerts to smart lights for when a Pomodoro alarm is activated.


<a id="orgbfd7d4e"></a>

## MVP Features for Philips Hue Lights


<a id="orgf5350f4"></a>

### Send a state change request after 25 min to indicate small break time of 5 min


<a id="org021d3f7"></a>

### Send a state change reqest after the 5 min break has expired

This project is nothing serious and it is my first attempt to learn the scala language.

